##Taller N°3: Manejo de DataFrame en R

---


#### Jose Luis Ropero Lozano

In [28]:
# Crear el DataFrame en R
conos <- data.frame(
  Sabor = c('mora', 'vainilla', 'chocolate', 'mora', 'chocolate'),
  Precio = c(3500, 4700, 6500, 5200, 5700)
)

# Mostrar el DataFrame
print(conos)

      Sabor Precio
1      mora   3500
2  vainilla   4700
3 chocolate   6500
4      mora   5200
5      mora   4000
6 chocolate   5700

# Ordenamiento y exploracion del DataFrame

In [ ]:
# Mostrar una variable del DF
conos["Sabor"]

  Sabor
1 mora
2 vainilla
3 chocolate
4 mora
5 chocolate

In [ ]:
# Extraer variables por nombre del DataFrame
conos[c('Precio', 'Sabor')]

  Precio Sabor
1 3500   mora
2 4700   vainilla
3 6500   chocolate
4 5200   mora
5 5700   chocolate

In [ ]:
# Invertir las filas del DataFrame

# nrow(conos) da el número total de filas.
# nrow(conos):1 crea una secuencia de números decreciente (por ejemplo, de 5 a 1).
# Al poner eso en la parte de las filas [filas, columnas], estamos seleccionando las filas en orden inverso.

conos[nrow(conos):1, ]

  Sabor     Precio
5 chocolate 5700
4 mora      5200
3 chocolate 6500
2 vainilla  4700
1 mora      3500

In [ ]:
# Seleccionar las filas 2 y 3 en R

# En R, el índice empieza en 1 (no en 0 como en Python).
# 2:3 selecciona directamente las filas 2 y 3.
# El espacio después de la coma [,] indica "todas las columnas".

conos[2:3, ]

  Sabor     Precio
2 vainilla  4700
3 chocolate 6500

In [ ]:
# Organizar de forma ascendente por Sabor
conos[order(conos$Sabor), ]

  Sabor     Precio
3 chocolate 6500
5 chocolate 5700
1 mora      3500
4 mora      5200
2 vainilla  4700

In [ ]:
# Explorar desde el primer registro (primeras 2 filas)
head(conos, 2)

  Sabor    Precio
1 mora     3500
2 vainilla 4700

In [ ]:
# Explorar desde el último registro (últimas 2 filas)
tail(conos, 2)

  Sabor     Precio
4 mora      5200
5 chocolate 5700

In [ ]:
# Un registro aleatorio

# sample(1:nrow(conos), 1) elige un número aleatorio entre 1 y el número de filas.
# Luego se extrae esa fila del DataFrame.

conos[sample(1:nrow(conos), 1), ]

In [ ]:
# Estadísticas descriptivas
summary(conos)

    Sabor               Precio
 Length:5           Min.   :3500
 Class :character   1st Qu.:4700
 Mode  :character   Median :5200
                    Mean   :5120
                    3rd Qu.:5700
                    Max.   :6500

In [ ]:
# Estructura del DataFrame
str(conos)

'data.frame':	5 obs. of  2 variables:
 $ Sabor : chr  "mora" "vainilla" "chocolate" "mora" ...
 $ Precio: num  3500 4700 6500 5200 5700

In [ ]:
# Índices (nombres de filas)
rownames(conos)

[1] "1" "2" "3" "4" "5"

In [ ]:
# Seleccionar Fila 4
conos[4, ]

  Sabor Precio
4 mora  5200

In [ ]:
# Desde la fila 2 hasta el final
conos[2:nrow(conos), ]

  Sabor     Precio
2 vainilla  4700
3 chocolate 6500
4 mora      5200
5 chocolate 5700

In [ ]:
# Filas 3 y 4
conos[3:4, ]

  Sabor     Precio
3 chocolate 6500
4 mora      5200

In [ ]:
# Filas 2 y 5
conos[c(2,5), ]

  Sabor     Precio
2 vainilla  4700
5 chocolate 5700

In [ ]:
# Precio en la fila 3
conos[3, "Precio"]

[1] 6500

In [ ]:
# Otra forma usando $ (acceso directo a columna)
conos$Precio[3]

[1] 6500

# Indices personalizados y Condicones Logicas

In [30]:
# Crear rownames únicos automáticos
rownames(conos) <- make.unique(as.character(conos$Sabor))
conos

            Sabor     Precio
mora        mora      3500
vainilla    vainilla  4700
chocolate   chocolate 6500
mora.1      mora      5200
mora.2      mora      4000
chocolate.1 chocolate 5700

In [32]:
# Mostrar nombres de fila (rownames)
rownames(conos)

[1] "mora"        "vainilla"    "chocolate"   "mora.1"      "mora.2"
[6] "chocolate.1"

In [33]:
View(conos)  # Abre una ventana de tabla con los rownames visibles

            Sabor     Precio
mora        mora      3500
vainilla    vainilla  4700
chocolate   chocolate 6500
mora.1      mora      5200
mora.2      mora      4000
chocolate.1 chocolate 5700

In [35]:
# Seleccionar fila con nombre 'chocolate' (usando rownames)
conos["chocolate", ]

          Sabor     Precio
chocolate chocolate 6500

In [36]:
# Precio del sabor 'vainilla'
conos["vainilla", "Precio"]

[1] 4700

# Filtro por condicion logica

In [37]:
# Filtro lógico
conos_i$Precio > 5000

# Aplicar el filtro
conos_i[conos_i$Precio > 5000, ]

[1] FALSE FALSE  TRUE  TRUE  TRUE

  Sabor     Precio
3 chocolate 6500
4 mora      5200
5 chocolate 5700

In [38]:
# Fitro directamente
conos[conos$Precio > 5000, ]

            Sabor     Precio
chocolate   chocolate 6500
mora.1      mora      5200
chocolate.1 chocolate 5700

# Filtro con mascara TRUE FALSE

In [39]:
conos$Precio > 5000
conos[conos$Precio > 5000, ]

[1] FALSE FALSE  TRUE  TRUE FALSE  TRUE

            Sabor     Precio
chocolate   chocolate 6500
mora.1      mora      5200
chocolate.1 chocolate 5700

# Condición múltiple: chocolate con precio < 6000

In [41]:
conos[conos$Precio < 6000 & conos$Sabor == "chocolate", ]

            Sabor     Precio
chocolate.1 chocolate 5700